#+TITLE: git-share a git repository resolver

# FIXME this needs to be called before tangling can continue ... how safely ...
#+call: def-project-name-base()

#+name: project-description-short
#+header: :results value drawer
#+begin_src elisp :exports results :eval no-export
"A git repository registration service and resolver."
#+end_src

#+RESULTS: project-description-short
:results:
A git repository registration service and resolver.
:end:

**** cl
Use =dexador= as our http client.
#+begin_src lisp :results none
(ql:quickload :dexador)
#+end_src

#+begin_src lisp :results drawer
(dex:post (concatenate 'string
                       "http://localhost:4242/git/e6cf3a391686a0b49171b9b195da88e81125bb1e"
                       "?remote=https://github.com/tgbugs/git-share.git"))
#+end_src

#+RESULTS:
:results:
"Register: git:e6cf3a391686a0b49171b9b195da88e81125bb1e -> https://github.com/tgbugs/git-share.git"
200
#<HASH-TABLE :TEST EQUAL :COUNT 4 {1007F42E83}>
#<QURI.URI.HTTP:URI-HTTP http://localhost:4242/git/e6cf3a391686a0b49171b9b195da88e81125bb1e?remote=https://github.com/tgbugs/git-share.git>
#<SB-SYS:FD-STREAM for "socket 127.0.0.1:41104, peer: 127.0.0.1:4242" {1007F405E3}>
:end:

#+begin_src lisp :results drawer
(dex:get "http://localhost:4242/git/e6cf3a391686a0b49171b9b195da88e81125bb1e")
#+end_src

#+RESULTS:
:results:
"Id: git:e6cf3a391686a0b49171b9b195da88e81125bb1e -> ((git@github.com:tgbugs/git-share.git)
                                                     (https://github.com/tgbugs/git-share.git))"
200
#<HASH-TABLE :TEST EQUAL :COUNT 4 {1007B55C73}>
#<QURI.URI.HTTP:URI-HTTP http://localhost:4242/git/e6cf3a391686a0b49171b9b195da88e81125bb1e>
#<SB-SYS:FD-STREAM for "socket 127.0.0.1:41050, peer: 127.0.0.1:4242" {1007B534A3}>
:end:
**** bash/curl
#+begin_src bash
time for i in {0..9999}; do echo $i; done | \
xargs -P15 -r -n 1 -- curl -X GET http://localhost:4242/git/e6cf3a391686a0b49171b9b195da88e81125bb1e -H
#+end_src

|  time | avg       |
|-------+-----------|
|   6.8 | 6.8072857 |
|   6.7 | 1469.0143 |
| 6.542 |           |
| 7.323 |           |
| 7.045 | slad      |
| 6.306 |           |
| 6.935 | slad      |
#+TBLFM: @2$2=vmean(@2$1..@>$1)
#+TBLFM: @3$2=(10000 / @2$2)

